/*Array Element Insertion*/
/*
    Пока что тут упрощенная функция, и в последствии она будет забафана
    нормальным алгоритмом
    Требования:
    - Ввод массивов с любым кол-вом измерений
    - Ввод большого кол-ва значений сразу (построчно? через string?)
    (Проверять каждый в цикле своей старой проверкой на корректность? забафать её силой указателей чтобы в случае ошибки возвращала NULL? использовать побочный эффект функции?)
    - Коррекция отдельных неверно введённых значений по-одному вручную после массового ввода
    - Ввод массивов любых типов (юзать union?)
    - Допустимость ввода только выбранного кол-ва элементов конкретного массива, если будет введено больше, то они отбросятся
*/

enum type{character, integer, real};

void arelins(void *ptr, enum type t, int len){
    switch(){

    }
}
